
осталось:  
    7. идентифай ссш и телнет протестировать нужно 
    8. перепройтись по root на всякий случай, после изменений
    9. убрать левые коменты
    10. добавить нужные коменты
    11. сделать документацию


/*
блять идентифай не протестирован ещё вообще

*/

особенности которые обязательно в документации написать:
	1. нельзя отправлять ? в некоторых коммутаторах ( в частности cisco ) = приводит к тому что программа не сможет корректно считать следующий вывод (точнее можно, но если это последняя команда которую вы хотите отправить)
	2. в прошивке cisco для show run и прочих с --More-- требуется ввести term le 0, иначе будет получен не полный вывод команды
  3. таймаут подключения - 2 минуты (меняется в коде) в течении которых программа не может считать ответ от удалённого хоста (для каждого хоста отдельный)
  4. linksys коммутаторы - программно уродски реализован интерфейс ssh и к нему из программы подключиться невозможно
	



так пока не забыл запишу (дополнительно можно вернуться сделать в будующем)
- нужно разделение на группы по 255(500-750) максимум за цикл из общего выбора
