осталось:  
    3. телнет сессии 
    4. вся прочая фигня в рутах 
    7.идентифай протестировать нужно


/*
блять идентифай не протестирован ещё вообще

*/

особенности которые обязательно в документации написать:
	1. нельзя отправлять ? в некоторых коммутаторах ( в частности cisco ) = приводит к тому что программа не сможет корректно считать следующий вывод (точнее можно, но если это последняя команда которую вы хотите отправить)
	2. в прошивке cisco для show run и прочих с --More-- требуется ввести term le 0, иначе будет получен не полный вывод команды
  3. таймаут подключения - 2 минуты (меняется в коде) в течении которых программа не может считать ответ от удалённого хоста (для каждого хоста отдельный)
  4. linksys коммутаторы - программно уродски реализован интерфейс ssh и к нему из программы подключиться невозможно
  5. телнет из-за специфики протокола не поддерживаетвы выход комбинацией клавишь, точнее это реализовывать слишком запарно и я рышел забить




так пока не забыл запишу
- нужно разделение на группы по 255(500-750) максимум за цикл из общего выбора
- сделать идентифай и нормально прикрутить к коммиту telnet